"USSD_ERROR" = "Ralat menjalankan permintaan";
"USSD_TERMINATED" = "Sesi Dihancurkan";

"%@ Call Forwarding\n%@\n%@%@" = "%@ Pemajuan Panggilan\n%@\n%@%@";
"%@ Call Waiting\n%@" = "%@ Panggilan Menunggu\n%@";
"%@ Call Barring\n%@\n%@" = "%@ Sekatan Panggilan\n%@\n%@";
"%@ Fixed Dialing\n%@" = "%@ Dailan Tetap\n%@";
"Connected Line Presentation\n%@" = "Paparan Talian Bersambung\n%@";
"Calling Line Presentation\n%@" = "Paparan Talian Panggilan\n%@";
"Connected Line ID Restriction\n%@" = "Sekatan ID Talian Disambung\n%@";
"Calling Line ID Restriction\n%@" = "Sekatan ID Talian Panggilan\n%@";
"SIM Lock\n%@" = "Kunci SIM\n%@";
"Service Center Address\n%@" = "Alamat Pusat Khidmat\n%@";
"Supplementary Service Password\n%@" = "Kata Laluan Khidmat Tambahan\n%@";
"Calling Name Presentation\n%@" = "Paparan Nama Panggilan\n%@";

"Forwards to %@\n" = "Majukan ke %@\n";

"All Calls" = "Semua Panggilan";
"All Conditional Calls" = "Semua Panggilan Bersyarat";
"Async Data Circuit" = "Async Sirkuit Data";
"Data" = "Data";
"Fax" = "Fax";
"Packet Access" = "Akses Paket";
"Pad Access" = "Akses Pad";
"SMS" = "SMS";
"Sync Data Circuit" = "Penyelarasan Sirkuit Data ";
"Voice" = "Suara";

"All Outgoing" = "Semua yang Keluar";
"All Incoming" = "Semua Masuk";
"Outgoing International" = "Panggilan Antarabangsa";
"Outgoing International, Except Home Country" = "Panggilan Antarabangsa, Kecuali Negara Asal";
"Incoming While Roaming Outside Home Country" = "Masuk Ketika Roaming Diluar Negara Asal";
"Incoming, Not On SIM" = "Masuk, Tidak Pada SIM";
"All Services" = "Semua Layanan";
"All Outgoing Services" = "Semua Layanan Keluar";
"All Incoming Services" = "Semua Perkhidmatan Masuk";

"Disabled" = "Dimatikan";
"Enabled" = "Dibolehkan";

"On All Calls" = "Pada Semua Panggilan";
"When Busy" = "Ketika Sibuk";
"When Unanswered" = "Apabila Tidak Dijawap";
"When Unreachable" = "Apabila Tidak Dapat Dicapai";

"Setting %@ Succeeded" = "Seting %@ Berjaya\n";
"Setting Interrogation Succeeded" = "Permintaan Seting Berjaya\n";
"Setting %@ Failed" = "Seting %@ Gagal\n";
"Setting Interrogation Failed" = "Permintaan Seting Gagal\n";

"Not Available" = "Tidak Tersedia";
"Network Controlled" = "Rangkaian Dikawal";
"Temporarily Disabled" = "Tidak Diizinkan untuk Sementara Waktu";
"Temporarily Enabled" = "Diperbolehkan Untuk Sementara Waktu";
"Unknown" = "Tidak Diketahui";

"Activation" = "Pengaktifan";
"Deactivation" = "Penyahaktifan";
"Interrogation" = "Interogasi";
"Registration" = "Registrasi";
"Erasure" = "Pemadaman";

"No Address" = "Tiada Alamat";
"No Service Specified" = "Tiada Perkhidmatan Ditentukan";
"Type %d" = "jenis %d";

// generic error
"CALL_FAILED" = "Gagal";
// error codes
"kCTNoError" = "Tiada Ralat";
"kCTUnknownError" = "Ralat Tidak Diketahui";
"kCTErrorRadioFailure" = "Radio Gagal";
// Generic network errors
"kCTErrorNetworkFailure" = "Kegagalan Rangkaian";
"kCTErrorCongestion" = "Rangkaian Terlalu Sibuk";
"kCTErrorUnidentifiedSubscriber" = "Pendaftar Tidak Dikenal";
"kCTErrorFacilityRejected" = "Kemudahan Ditolak";
"kCTErrorUnknownSubscriber" = "Pendaftar Tidak Diketahui";
"kCTErrorNetworkOutOfOrder" = "Rangkaian Mengalami Kerosakan";
"kCTErrorInvalidTransactionIdentifier" = "Pengenalpasti Transaksi Tidak Sah";
"kCTErrorSemanticallyIncorrectMessage" = "Mesej salah secara semantik";
"kCTErrorInvalidMandatoryInformation" = "Maklumat Mandatori Tidak Sah";
"kCTErrorMessageTypeNonExistant" = "Jenis Mesej Tidak Wujud";
"kCTErrorMessageNotCompatibleWithProtocolState" = "Mesej tidak sesuai dengan Keadaan Protokol";
"kCTErrorInformationElementNonExistant" = "Unsur Maklumat Tidak Wujud";
"kCTErrorProtocolErrorUnspecified" = "Ralat Protokol Tidak ditentukan";
"kCTErrorTemporaryFailure" = "Gagal Sementara";
"kCTErrorResourcesUnavailable" = "Sumber Tidak Tersedia";
"kCTErrorRequestedFacilityNotSubscribed" = "Kemudahan yang Diminta Tidak didaftar";
"kCTErrorRequestedFacilityNotImplemented" = "Kemudahan yang Diminta Belum Diimplementasikan";
"kCTErrorInterworkingError" = "Ralat Jalinan Kerja";
"kCTErrorInterworkingNotSupported" = "Antara-Rangkaian Tak Disokong";
"kCTErrorCommandCannotBeActioned" = "Perintah Tidak Boleh Dilaksanakan";
"kCTErrorNoNetworkService" = "Tiada Perkhidmatan Rangkaian";
// Call related errors
"kCTErrorUnassignedNumber" = "Nombor Belum Dipilih";
"kCTErrorOperatorDeterminedBarring" = "Penentuan Halangan Operator";
"kCTErrorCallBarred" = "Panggilan Dihalang";
"kCTErrorUserBusy" = "Pengguna Sibuk";
"kCTErrorNoUserResponding" = "Tiada Pengguna Membalas";
"kCTErrorNumberChanged" = "Nombor Telah Diubah";
"kCTErrorInvalidNumberFormat" = "Format Nombor Tidak Sah";
"kCTErrorCallRejected" = "Panggilan Ditolak";
// SIM errors
"kCTErrorSimNotInserted" = "SIM Belum Dimasukkan";
"kCTErrorSimPinRequired" = "PIN SIM Diperlukan";
"kCTErrorSimPukRequired" = "PUK SIM Diperlukan";
"kCTErrorSimFailure" = "SIM Gagal";
"kCTErrorSimMemoryFailure" = "Memori SIM Gagal";
"kCTBadPinFormatError" = "Format PIN Buruk";
"kCTErrorNumberNotAllowed" = "Nombor Tidak Diizinkan";
"kCTErrorIncorrectPassword" = "Kata Laluan Salah";
// SMS Errors
"kCTErrorShortMessageTransferRejected" = "Pemindahan Mesej Ringkas Ditolak";
"kCTErrorDestinationOutOfOrder" = "Tujuan Sedang Mengalami Kerosakan";
"kCTErrorClass0NotSupported" = "Kelas 0 Tidak Sesuai";
"kCTErrorCannotReplaceSm" = "Tidak Boleh Mengganti SIM";
"kCTErrorUnspecifiedPid" = "PID Tidak Ditentukan";
"kCTErrorDataCodingSchemeNotSupported" = "Skema Kod Data Tidak sesuai";
"kCTErrorUnspecifiedDcs" = "Ralat DCS Tidak Ditentukan";
"kCTErrorCommandUnsupported" = "Perintah Tidak sesuai";
"kCTErrorUnspecifiedTpCommand" = "Ralat Arahan TP Tidak Ditentukan";
"kCTErrorTpduNotSupported" = "TPDU Tidak sesuai";
"kCTErrorScBusy" = "SC Sibuk";
"kCTErrorRejectedBySimSmsControl" = "Ditolak oleh Kawalan SMS SIM";
// GPRS Errors
"kCTErrorGprsIllegalMs" = "MS GPRS Tidak Sah";
"kCTErrorGprsIllegalMe" = "ME GPRS Tidak Sah";
"kCTErrorGprsServicesNotAllowed" = "Layanan GPRS Tidak Diizinkan";
"kCTErrorGprsPlmnNotAllowed" = "PLMN GPRS Tidak Diizinkan";
"kCTErrorGprsLocationAreaNotAllowed" = "Area Lokasi GPRS Tidak Diizinkan";
"kCTErrorGprsRoamingNotAllowedInLocationArea" = "Roaming GPRS Tidak Diizinkan Di Lokasi";
"kCTErrorGprsServiceOptionNotSupported" = "Pilihan Layanan GPRS Tidak sesuai";
"kCTErrorGprsServiceOptionNotSubscribed" = "Pilihan Layanan GPRS Tidak Terdaftar";
"kCTErrorGprsServiceOptionTemporarilyOutOfOrder" = "Pilihan Layanan GPRS Mengalami Kerosakan Sementara";
"kCTErrorGprsPdpAuthenticationFailure" = "Pengesahan GPRS PDP Gagal";
"kCTErrorGprsInvalidMobileClass" = "Kelas Handphone GPRS Salah";
"kCTErrorGprsUnspecified" = "GPRS Tidak Ditentukan";
"kCTErrorGprsMissingorUnknownAPN" = "GPRS Hilang atau APN Tidak Dikenali";
"kCTErrorGprsPDPAuthenticationInfoRejectedByBaseband" = "Maklumat Pengesahan PDP GPRS Ditolak oleh Baseband";
